Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ལུས་ཀྱི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། སེམས་ཀྱི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན་ཏེ།
en: VII: 23} “Subhūti, if you ask how, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of perseverance with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they possess physical perseverance and they possess mental perseverance, with a mind that is devoid of concepts in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, starting from the time when they first begin to set their mind on enlightenment. “

source: དེ་ལུས་ཀྱི་བརྩོན་འགྲུས་ལ་གནས་ནས། བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Abiding in physical perseverance, they achieve and maintain the first meditative concentration, and then they achieve and maintain the second meditative concentration, the third meditative concentration, and the fourth meditative concentration.

source: །དེ་བསམ་གཏན་བཞི་པ་ལ་མཉམ་པར་གཞག་ཅིང་། རྫུ་འཕྲུལ་གྱི་རྣམ་པ་དུ་མ་ཉམས་སུ་མྱོང་བར་བྱེད་དོ། །ཉི་མ་དང་ཟླ་བའི་བར་དུ་ལག་པས་བྱུགས་ཤིང་། ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱི་དབང་བསྒྱུར་ཏེ། དེ་ལུས་ཀྱི་བརྩོན་འགྲུས་དེ་ལྟ་བུ་དང་ལྡན་པས་རྫུ་འཕྲུལ་གྱི་རྣམ་པ་དེས། ཕྱོགས་
en: Absorbed in the fourth meditative concentration, they experience many modes of miraculous ability—they can touch the sun and moon with their hands, and hold sway with their physical body as far as the world realms of Brahmā.

source: བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད། གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ཏུ་སོང་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་མང་པོས་བསྙེན་བཀུར་བྱེད་དེ། ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་མང་པོ་དེ་དག་ཀྱང་། ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཟད་པར་མི་འགྱུར་ཏེ།
en: They venerate all the lord buddhas, as many as are alive and present in the immeasurable, countless, and inestimable world systems of the ten directions, with robes, alms, bedding, medicines, and many resources, and these robes, alms, bedding, medicines, and many resources will not be depleted until they attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོས།
en: Even after attaining consummate buddhahood in enlightenment, they will continue to please the world with its gods, humans, and asuras by means of clothing, alms, bedding, medicines, and many resources.

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་བདེ་བར་འགྱུར་རོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་། རིང་བསྲེལ་ལ་རིང་བསྲེལ་གྱི་མཆོད་པ་མང་པོ་འབྱུང་བར་འགྱུར་རོ།
en: Even after attaining final nirvāṇa, many reliquary offerings will appear before their sacred relics.

source: །རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་དེ་ཉིད་ཀྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་དྲུང་དུ་སོང་ཞིང་ཆོས་ཉན་ཏེ། ཇི་སྐད་དུ་ཐོས་པ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་ཆུད་ཟ་བར་མི་འགྱུར་རོ།
en: Through mastery of miraculous abilities, they will listen to the Dharma in the presence of those lord buddhas, and they will never squander that which they have heard until they have attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་འཛིན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: Conducting themselves in all-aspect omniscience, they also bring beings to maturity and refine the buddhafields.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་ལུས་ཀྱི་བརྩོན་འགྲུས་དང་ལྡན་པས། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, those who possess physical perseverance complete the perfection of perseverance in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned. “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་སེམས་ཀྱི་བརྩོན་འགྲུས་འཕགས་པ་ཟག་པ་མེད་པ། ལམ་གྱི་ཡན་ལག་གི་ཁོངས་སུ་ཆུད་པ་དང་ལྡན་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སེམས་ཀྱི་བརྩོན་འགྲུས་དང་ལྡན་པས།
en: Subhūti, if you ask how bodhisattva great beings complete the perfection of perseverance endowed with mental perseverance, comprehending the aspects of the uncontaminated noble path, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they possess mental perseverance with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, starting from the time when they first begin to set their mind on enlightenment.

source: ལུས་ཀྱི་ལས་མི་དགེ་བའི་སྐབས་མི་འབྱེད། ངག་གི་ལས་མི་དགེ་བའི་སྐབས་མི་འབྱེད། ཡིད་ཀྱི་ལས་མི་དགེ་བའི་སྐབས་མི་འབྱེད་དོ། །རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བ་འམ། བདེ་ཞེས་བྱ་བ་འམ། སྡུག་བསྔལ་ཞེས་བྱ་བ་འམ། བདག་ཅེས་བྱ་བ་འམ། བདག་མེད་ཅེས་བྱ་བ་འམ།
en: They do not allow any opportunity for nonvirtuous actions of body to arise, they do not allow any opportunity for nonvirtuous actions of speech to arise, and they do not allow any opportunity for nonvirtuous actions of mind to arise. “

source: ཞི་ཞེས་བྱ་བ་འམ། མ་ཞི་ཞེས་བྱ་བ་འམ། དགེ་ཞེས་བྱ་བ་འམ། མི་དགེ་ཞེས་བྱ་བ་འམ། འཇིག་རྟེན་པ་ཞེས་བྱ་བ་འམ། འཇིག་རྟེན་ལས་འདས་ཞེས་བྱ་བ་འམ། ཉོན་མོངས་པ་དང་བཅས་ཞེས་བྱ་བ་འམ། ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱ་བ་འམ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཞེས་བྱ་བ་འམ། ཁ་ན་མ་ཐོ་བ་མེད་ཅེས་བྱ་བ་འམ། ཟག་པ་དང་བཅས་ཞེས་བྱ་བ་འམ། ཟག་པ་མེད་ཅེས་བྱ་བ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་ཞེས་བྱ་བ་འམ། རྣམ་པར་བྱང་བ་ཞེས་བྱ་བ་འམ། འདུས་བྱས་ཞེས་བྱ་བ་འམ།
en: They do not entertain notions of anything being ‘permanent’ or ‘impermanent,’ ‘imbued with happiness’ or ‘imbued with suffering,’ ‘self’ or ‘nonself,’ ‘at peace’ or ‘not at peace,’ ‘virtuous’ or ‘nonvirtuous,’ ‘mundane’ or ‘supramundane,’ ‘afflicted’ or ‘unafflicted,’ ‘inadmissible’ or ‘admissible,’ ‘contaminated’ or ‘uncontaminated,’ ‘defiled’ or ‘purified,’ or ‘conditioned’ or ‘unconditioned.’

source: འདུས་མ་བྱས་ཞེས་བྱ་བར་སེམས་པ་མེད་དོ། །འདོད་པའི་ཁམས་སམ། གཟུགས་ཀྱི་ཁམས་སམ། གཟུགས་མེད་པའི་ཁམས་སམ། ཟག་པ་དང་བཅས་པའི་ཁམས་སམ། ཟག་པ་མེད་པའི་ཁམས་སམ། བསམ་གཏན་དང་པོ་འམ། བསམ་གཏན་གཉིས་པ་འམ། བསམ་གཏན་གསུམ་པ་འམ། བསམ་གཏན་བཞི་པ་འམ། བྱམས་པ་འམ། སྙིང་རྗེ་འམ། དགའ་བ་འམ། བཏང་སྙོམས་སམ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དམ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དམ། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དམ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། ནང་སྟོང་པ་ཉིད་དམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རམ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སམ། ཡང་དག་པར་སྤོང་བ་རྣམས་སམ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་སམ། དབང་པོ་རྣམས་སམ། སྟོབས་རྣམས་སམ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་སམ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འམ། འཕགས་པའི་བདེན་པ་རྣམས་སམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། སྟོང་པ་ཉིད་དམ། མཚན་མ་མེད་པ་འམ། སྨོན་པ་མེད་པ་འམ། མངོན་པར་ཤེས་པ་འམ། ཏིང་ངེ་འཛིན་ཏམ། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ།
en: They do not lay claim to notions of anything being ‘the realm of desire,’ ‘the realm of form,’ ‘the realm of formlessness,’ ‘the contaminated realms,’ ‘the uncontaminated realms,’ ‘the first meditative concentration,’ ‘the second meditative concentration,’ ‘the third meditative concentration,’ ‘the fourth meditative concentration,’ ‘loving kindness,’ ‘compassion,’ ‘empathetic joy,’ ‘equanimity,’ ‘the sphere of infinite space,’ {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། བྱམས་པ་ཆེན་པོ་འམ། སྙིང་རྗེ་ཆེན་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ཡང་། རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བ་འམ། བདེ་ཞེས་བྱ་བ་འམ། སྡུག་བསྔལ་ཞེས་བྱ་བ་འམ། བདག་ཅེས་བྱ་བ་འམ། བདག་མེད་ཅེས་བྱ་བ་འམ། ཞི་ཞེས་བྱ་བ་འམ། མ་ཞི་ཞེས་བྱ་བ་འམ། དགེ་ཞེས་བྱ་བ་འམ། མི་དགེ་ཞེས་བྱ་བ་འམ། འཇིག་རྟེན་ཞེས་བྱ་བ་འམ། འཇིག་རྟེན་ལས་འདས་ཞེས་བྱ་བ་འམ། ཉོན་མོངས་པ་དང་བཅས་ཞེས་བྱ་བ་འམ། ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱ་བ་འམ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཞེས་བྱ་བ་འམ། ཁ་ན་མ་ཐོ་བ་མེད་ཅེས་བྱ་བ་འམ། ཟག་པ་དང་བཅས་ཞེས་བྱ་བ་འམ། ཟག་པ་མེད་ཅེས་བྱ་བ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་ཞེས་བྱ་བ་འམ། རྣམ་པར་བྱང་བ་ཞེས་བྱ་བ་འམ། འདུས་བྱས་ཞེས་བྱ་བ་འམ། འདུས་མ་བྱས་ཞེས་བྱ་བར་བསྙེམས་པ་མེད་དོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུར་བསྙེམས་པ་མེད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: VII: 24} ‘the sphere of infinite consciousness,’ ‘the sphere of nothing-at-all,’ ‘the sphere of neither perception nor nonperception,’ ‘the perfection of generosity,’ ‘the perfection of ethical discipline,’ ‘the perfection of tolerance,’ ‘the perfection of perseverance,’ ‘the perfection of meditative concentration,’ ‘the perfection of wisdom,’ ‘the emptiness of internal phenomena,’ [the other aspects of emptiness], up to and including ‘the emptiness of the essential nature of nonentities,’ ‘the applications of mindfulness,’ ‘the correct exertions,’ ‘the supports for miraculous ability,’ ‘the faculties,’ ‘the powers,’ ‘the branches of enlightenment,’ ‘the noble eightfold path,’ ‘the truths of the noble ones,’ ‘the meditative concentrations,’ ‘the immeasurable attitudes,’ ‘the formless absorptions,’ ‘the aspects of liberation,’ ‘the serial steps of meditative absorption,’ ‘emptiness,’ ‘signlessness,’ ‘wishlessness,’ ‘the extrasensory powers,’ ‘the meditative stabilities,’ ‘the dhāraṇī gateways,’ ‘the powers of the tathāgatas,’ ‘the fearlessnesses,’ ‘the kinds of exact knowledge,’ ‘great loving kindness,’ ‘great compassion,’ or even the distinct qualities of the buddhas are ‘permanent’ or ‘impermanent,’ ‘imbued with happiness’ or ‘imbued with suffering,’ ‘self’ or ‘nonself,’ ‘at peace’ or ‘not at peace,’ ‘virtuous’ or ‘nonvirtuous,’ ‘mundane’ or ‘supramundane,’ ‘afflicted’ or ‘unafflicted,’ ‘inadmissible’ or ‘admissible,’ ‘contaminated’ or ‘uncontaminated,’ ‘defiled’ or ‘purified,’ or ‘conditioned’ or ‘unconditioned.’

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉིད་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྙེམས་པ་མེད་དོ། །རྒྱུན་ཏུ་ཞུགས་པ་ཞེས་བྱ་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་ཞེས་བྱ་བ་དང་།
en: They do not lay claim to the fruit of entering the stream to nirvāṇa, and they do not misconstrue the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, the state of the bodhisattvas, or unsurpassed, complete enlightenment.

source: ཕྱིར་མི་འོང་བ་ཞེས་བྱ་བ་དང་། དགྲ་བཅོམ་པ་ཞེས་བྱ་བ་དང་། རང་སངས་རྒྱས་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཞེས་བྱ་བར་བསྙེམས་པ་མེད་དོ། །སེམས་ཅན་འདི་དག་ནི་མཐོང་བའི་ལམ་གྱིས་བརྗོད་པ་འདི་དག་ནི་བསྲབས་པའི་སས་བརྗོད་པ།
en: They do not lay claim to notions of ‘one who has entered the stream to nirvāṇa,’ ‘one who is destined for only one more rebirth,’ ‘one who is no longer subject to rebirth,’ or an ‘arhat,’ ‘pratyekabuddha,’ ‘bodhisattva,’ or ‘buddha.’ “

source: འདི་དག་ནི་དམ་པ་མ་ཡིན་པའི་ཆ་ཅན་གྱིས་བརྗོད་པ། འདི་དག་ནི་བླ་མའི་ཆ་ཅན་གྱིས་བརྗོད་པ། འདི་དག་ནི་རང་སངས་རྒྱས་ཉིད་ཀྱིས་བརྗོད་པ། འདི་དག་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱིས་བརྗོད་པ། འདི་དག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་བརྗོད་པ་ཞེས་བྱ་བར་ཡང་བསྙེམས་པ་མེད་དོ།
en: Nor indeed do they lay claim to these beings as ranked on the level of insight, these as ranked on the level of attenuated refinement, these as ranked at a lower status, these as ranked at a higher status, these as ranked as having the status of pratyekabuddhas, these as ranked as having knowledge of the path, or these as ranked as having all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་དག་ལ་ངོ་བོ་ཉིད་གང་གིས་བརྗོད་པར་བྱ་བའི་ངོ་བོ་ཉིད་དེ།
en: If you ask why, it is because there is no essential nature for ranking them as having any such essential natures.

source: སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་དེ་ལྟ་བུ་དང་ལྡན་པས་མངོན་དུ་གྱུར་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དེ། སེམས་ཅན་དེ་དག་ཀྱང་མི་དམིགས་སོ།
en: Those endowed with such mental perseverance act for the benefit of beings even though they have actualized [their goal], but they do not at all apprehend those beings.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས་སོ།
en: They also complete the perfection of perseverance, but they do not at all apprehend that perfection of perseverance.

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ཀྱང་མི་དམིགས་སོ།
en: They also complete the attributes of the buddhas, but they do not at all apprehend the attributes of the buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་དེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡང་མི་དམིགས་སོ།
en: They also refine the buddhafields, but they do not at all apprehend the buddhafields.

source: །དེ་སེམས་ཀྱི་བརྩོན་འགྲུས་དེ་ལྟ་བུ་དང་ལྡན་པས། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཀྱང་དེ་ལ་ཆགས་པ་མེད་དེ།
en: Endowed with such mental perseverance, they acquire all virtuous attributes but they are not attached to them.

source: དེ་ཆགས་པ་མེད་པ་རྣམས་ཀྱི་དོན་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོའོ།
en: Those without attachment act for the benefit [of others] and proceed from buddhafield to buddhafield.

source: །འཇིག་རྟེན་གྱི་ཁམས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་སྟེ།
en: They proceed from mundane realm to mundane realm.

source: རྫུ་འཕྲུལ་དང་ཆོ་འཕྲུལ་གང་དང་གང་གིས་རྣམ་པར་འཕྲུལ་པར་འདོད་པའི་རྫུ་འཕྲུལ་དང་ཆོ་འཕྲུལ་དེ་དང་དེས་རྣམ་པར་འཕྲུལ་ཏེ། མེ་ཏོག་གི་ཆར་དབབ་པ་འམ། སྤོས་ཀྱི་ངད་དགྱེ་བ་འམ། འབྲུག་གི་སྒྲ་བསྒྲག་པ་འམ།
en: They conjure emanations by whatever miraculous abilities and miracles they wish to employ.

source: གླུ་དང་། སིལ་སྙན་གྱི་སྒྲ་བསྒྲག་པ་དང་། ས་བསྐྱོད་པ་དང་། སྣང་བ་བསྟན་པ་འམ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་བསྟན་པས་རྣམ་པར་འཕྲུལ་ཏེ།
en: That is to say, they conjure emanations by causing a shower of flowers to fall, by causing the fragrance of incense to waft, by causing thunder to reverberate, by causing the sound of songs and music to resonate, by causing earthquakes, by displaying appearances, or by displaying a world made of the seven precious metals and gems.

source: གང་དང་གང་དུ་གང་དང་གང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བ་དེ་དག་ཀྱང་བདག་གི་ལུས་ལས་འགྱེད་དེ།
en: In whatever circumstances, they also sacrifice their own bodies for the sake of beings.

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བར་འགའ་བ་དག་འགྱེད་དོ།
en: Sometimes they sacrifice themselves for the sake of beings.

source: །བར་འགའ་དྲི་ཞིམ་པོ་འགྱེད་དོ།
en: Sometimes they discharge delicious fragrance.

source: །བར་འགའ་སྲོག་གཅོད་པ་མེད་པའི་མཆོད་སྦྱིན་ཆེན་པོ་བྱེད་དོ།
en: Sometimes they make great offerings, without the taking of life. {Ki.

source: །བར་འགའ་སེམས་ཅན་མཐའ་ཡས་པ་ལམ་མ་ཡིན་པ་ནས་འདོན་ཏེ། སྲོག་གཅོད་པ་ལས་ཟློག་གོ །མ་བྱིན་པར་ལེན་པ་དང་།
en: VII: 25} Sometimes they extricate infinite beings from improper paths.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། ཕྲ་མ་སྨྲ་བ་དང་། ཞེ་གཅོད་པའི་ཚིག་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཚིག་ཀྱལ་པ་དང་།
en: They avert them from killing, and they release them from stealing, sexual misconduct, slander, words of reprimand, lying, nonsensical chatter, covetousness, malice, and wrong views.

source: ཆགས་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་ལས་ཡོངས་སུ་འགྲེལ་ཏོ། །ལ་ལ་ལ་ནི་སྦྱིན་པས་ཕན་འདོགས། ལ་ལ་ལ་ནི་ཚུལ་ཁྲིམས་ཀྱིས་ཕན་འདོགས།
en: They benefit some through generosity and they benefit some through ethical discipline.

source: ལ་ལའི་དོན་དུ་ཡན་ལག་དང་ཉིང་ལག་ཡོངས་སུ་གཏོང་ངོ་།
en: For some they give up their limbs and appendages.

source: །ལ་ལའི་དོན་དུ་ནི་བུ་དང་། ཆུང་མ་ཡོངས་སུ་གཏོང་ངོ་།
en: For some they renounce their children and wives.

source: །ལ་ལའི་དོན་དུ་ནི་རྒྱལ་སྲིད་ཡོངས་སུ་གཏོང་ངོ་།
en: For some they renounce a kingdom.

source: །ལ་ལའི་དོན་དུ་ནི་བདག་ཡོངས་སུ་གཏོང་སྟེ།
en: For some they sacrifice themselves.

source: དེ་ལྟར་ཐབས་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བའི་ཐབས་དེ་དང་དེས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: Thus they act for the benefit of beings by whatever means they can bring about the benefit of beings.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་སེམས་ཀྱི་བརྩོན་འགྲུས་དང་ལྡན་པས། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, those who possess mental perseverance complete the perfection of perseverance, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned. “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ།
en: Subhūti, if you ask how, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of meditative concentration in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they dwell in the perfection of meditative concentration with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, starting from the time when they first begin to set their mind on enlightenment.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་མ་གཏོགས་པར། ཏིང་ངེ་འཛིན་གཞན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: With the exception of the meditative stabilities of the tathāgatas, they complete all the [other] meditative stabilities.

source: །དེ་འདོད་པས་དབེན་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain the first meditative concentration, where there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from that freedom.

source: །བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They [similarly] achieve and maintain the second meditative concentration, the third meditative concentration, and the fourth meditative concentration.

source: །དེ་བྱམས་པ་དང་ལྡན་པའི་སེམས་དང་། སྙིང་རྗེ་དང་ལྡན་པའི་སེམས་དང་། དགའ་བ་དང་ལྡན་པའི་སེམས་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཀྱིས་འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་རྒྱས་པར་བཀང་ཞིང་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain [the immeasurable attitudes], extensively permeating all worlds encompassed by the realm of phenomena and infinite space in all respects with thoughts endowed with loving kindness, compassion, empathetic joy, and equanimity.

source: །དེ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་སོ།
en: They achieve and maintain the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: །དེ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་གནས་ཤིང་། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་ལུགས་དང་འཐུན་པ་དང་། ལུགས་དང་མི་འཐུན་པར་སྙོམས་པར་འཇུག་ཅིང་རྣམ་པར་ལྡང་ངོ་།
en: Abiding in this perfection of meditative stability, they are absorbed in the eight aspects of liberation, both consecutively and in reverse order, and then they arise from them.

source: །མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain the nine serial steps of meditative absorption, the meditative stability of emptiness, the meditative stability of signlessness, and the meditative stability of wishlessness.

source: །བར་ཆད་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །གློག་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain the meditative stability without obstacles, and they achieve and maintain the meditative stability that resembles lightning, the authentic meditative stability, and the vajra-like meditative stability.

source: །དེ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ནས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཁོངས་སུ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཆུད་པར་བྱས་ཤིང་། དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ལས་འདའོ། །དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ལས་འདས་ནས།
en: Abiding in this perfection of meditative stability, through the wisdom of knowledge of the path, they master all meditative stabilities included within knowledge of the path. {

source: རིགས་ཀྱི་ས་དང་།
en: Ki.

source: བརྒྱད་པའི་ས་དང་། མཐོང་བའི་ས་དང་། བསྲབས་པའི་ས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ས་དང་། བྱས་པ་རྟོགས་པའི་ས་དང་།
en: VII: 26} They transcend the level of bright insight, and they transcend the level of the spiritual family, the eighth-lowest level, the level of insight, the level of attenuated refinement, the level of no attachment, the level of [an arhat’s] spiritual achievement, and the level of the pratyekabuddhas.

source: རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདའོ། །རང་སངས་རྒྱས་ཀྱིས་ས་ལས་འདས་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: Having transcended the level of the pratyekabuddhas, they enter a bodhisattva’s full maturity.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས། སངས་རྒྱས་ཀྱི་ས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Having entered into the maturity of the bodhisattvas, they perfect the level of the buddhas.

source: །དེས་དེ་དག་ལ་སྤྱོད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་མ་ཐོབ་ཀྱི་བར་དུ་འབྲས་བུ་བར་མ་དོར་ཐོབ་པར་མི་བྱེད་དེ།
en: While engaging on these [levels], they do not in the interim acquire the fruits [of the path] until they have attained the wisdom of all-aspect omniscience.

source: ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཤིང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས།
en: Abiding in this perfection of meditative stability, they perfect the extrasensory powers.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ།
en: They venerate the lord buddhas and, proceeding from buddhafield to buddhafield, they continue to venerate the lord buddhas.
